Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/edc/PIC32MM0128GPM064.PIC
      <edc:SFRDef edc:_addr="0x1F808930" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="1" edc:access="--nnn--n-----------nnnnnnnn--nnn" edc:cname="DCRCCON" edc:desc="" edc:grp="DMAC" edc:impl="0xfb7fffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--xxx--x-----------xxxxx00x--000" edc:name="DCRCCON" edc:nzwidth="0x20" edc:por="--xxx--x-----------xxxxx00x--000" edc:portals="CLR SET INV" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CRCCH" edc:desc="" edc:mask="0x7" edc:name="CRCCH" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="CRCTYP" edc:desc="" edc:mask="0x1" edc:name="CRCTYP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CRCAPP" edc:desc="" edc:mask="0x1" edc:name="CRCAPP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCEN" edc:desc="" edc:mask="0x1" edc:name="CRCEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PLEN" edc:desc="" edc:mask="0x1f" edc:name="PLEN" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="BITO" edc:desc="" edc:mask="0x1" edc:name="BITO" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WBO" edc:desc="" edc:mask="0x1" edc:name="WBO" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BYTO" edc:desc="" edc:mask="0x3" edc:name="BYTO" edc:nzwidth="2"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F808940" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DCRCDATA" edc:desc="" edc:grp="DMAC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DCRCDATA" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCRCDATA" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="DCRCDATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F808950" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DCRCXOR" edc:desc="" edc:grp="DMAC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DCRCXOR" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCRCXOR" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="DCRCXOR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F808960" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="2" edc:access="----------------n------nnnnn-rnn" edc:cname="DCH0CON" edc:desc="" edc:grp="DMAC0" edc:impl="0xfffffff7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------x------00000-000" edc:name="DCH0CON" edc:nzwidth="0x20" edc:por="----------------x------00000-000" edc:portals="CLR SET INV" ltx:baseofperipheral="DMAC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHPRI" edc:desc="" edc:mask="0x3" edc:name="CHPRI" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CHEDET" edc:desc="" edc:mask="0x1" edc:name="CHEDET" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CHAEN" edc:desc="" edc:mask="0x1" edc:name="CHAEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHCHN" edc:desc="" edc:mask="0x1" edc:name="CHCHN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHAED" edc:desc="" edc:mask="0x1" edc:name="CHAED" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHEN" edc:desc="" edc:mask="0x1" edc:name="CHEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHCHNS" edc:desc="" edc:mask="0x1" edc:name="CHCHNS" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="CHBUSY" edc:desc="" edc:mask="0x1" edc:name="CHBUSY" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F808970" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="2" edc:access="--------nnnnnnnnnnnnnnnnssnnn---" edc:cname="DCH0ECON" edc:desc="" edc:grp="DMAC0" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------111111111111111100000---" edc:name="DCH0ECON" edc:nzwidth="0x20" edc:por="--------111111111111111100000---" edc:portals="CLR SET INV" ltx:memberofperipheral="DMAC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AIRQEN" edc:desc="" edc:mask="0x1" edc:name="AIRQEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIRQEN" edc:desc="" edc:mask="0x1" edc:name="SIRQEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PATEN" edc:desc="" edc:mask="0x1" edc:name="PATEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CABORT" edc:desc="" edc:mask="0x1" edc:name="CABORT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFORCE" edc:desc="" edc:mask="0x1" edc:name="CFORCE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHSIRQ" edc:desc="" edc:mask="0xff" edc:name="CHSIRQ" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="CHAIRQ" edc:desc="" edc:mask="0xff" edc:name="CHAIRQ" edc:nzwidth="0x8"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F808980" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="2" edc:access="--------nnnnnnnn--------nnnnnnnn" edc:cname="DCH0INT" edc:desc="" edc:grp="DMAC0" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000--------00000000" edc:name="DCH0INT" edc:nzwidth="0x20" edc:por="--------00000000--------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="DMAC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHERIF" edc:desc="" edc:mask="0x1" edc:name="CHERIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHTAIF" edc:desc="" edc:mask="0x1" edc:name="CHTAIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHCCIF" edc:desc="" edc:mask="0x1" edc:name="CHCCIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHBCIF" edc:desc="" edc:mask="0x1" edc:name="CHBCIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHDHIF" edc:desc="" edc:mask="0x1" edc:name="CHDHIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHDDIF" edc:desc="" edc:mask="0x1" edc:name="CHDDIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHSHIF" edc:desc="" edc:mask="0x1" edc:name="CHSHIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHSDIF" edc:desc="" edc:mask="0x1" edc:name="CHSDIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="CHERIE" edc:desc="" edc:mask="0x1" edc:name="CHERIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHTAIE" edc:desc="" edc:mask="0x1" edc:name="CHTAIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHCCIE" edc:desc="" edc:mask="0x1" edc:name="CHCCIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHBCIE" edc:desc="" edc:mask="0x1" edc:name="CHBCIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHDHIE" edc:desc="" edc:mask="0x1" edc:name="CHDHIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHDDIE" edc:desc="" edc:mask="0x1" edc:name="CHDDIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHSHIE" edc:desc="" edc:mask="0x1" edc:name="CHSHIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHSDIE" edc:desc="" edc:mask="0x1" edc:name="CHSDIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F808990" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="2" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DCH0SSA" edc:desc="" edc:grp="DMAC0" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="DCH0SSA" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="DMAC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCH0SSA" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="DCH0SSA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="CHSSA" edc:mask="0xffffffff" edc:name="CHSSA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
