Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/edc/PIC32MM0128GPM064.PIC
      <edc:SFRDef edc:_addr="0x1F80F0F0" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="--------------------------nnnnn-" edc:cname="IEC3" edc:desc="" edc:impl="0xffffff3e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000000000000000000--00000-" edc:name="IEC3" edc:nzwidth="32" edc:por="000000000000000000000000--00000-" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ECCBEIE" edc:mask="0x1" edc:name="ECCBEIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA0IE" edc:mask="0x1" edc:name="DMA0IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA1IE" edc:mask="0x1" edc:name="DMA1IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA2IE" edc:mask="0x1" edc:name="DMA2IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA3IE" edc:mask="0x1" edc:name="DMA3IE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F80F100" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:offset="0x40"/>
      <edc:SFRDef edc:_addr="0x1F80F140" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC0" edc:desc="" edc:impl="0x1F1f1F1F" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC0" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CTIS" edc:desc="" edc:mask="0x3" edc:name="CTIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CTIP" edc:desc="" edc:mask="0x7" edc:name="CTIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CS0IS" edc:desc="" edc:mask="0x3" edc:name="CS0IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CS0IP" edc:desc="" edc:mask="0x7" edc:name="CS0IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CS1IS" edc:desc="" edc:mask="0x3" edc:name="CS1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CS1IP" edc:desc="" edc:mask="0x7" edc:name="CS1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="INT0IS" edc:desc="" edc:mask="0x3" edc:name="INT0IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="INT0IP" edc:desc="" edc:mask="0x7" edc:name="INT0IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F150" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC1" edc:desc="" edc:impl="0x1F1F1F1F" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC1" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INT1IS" edc:desc="" edc:mask="0x3" edc:name="INT1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="INT1IP" edc:desc="" edc:mask="0x7" edc:name="INT1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="INT2IS" edc:desc="" edc:mask="0x3" edc:name="INT2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="INT2IP" edc:desc="" edc:mask="0x7" edc:name="INT2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="INT3IS" edc:desc="" edc:mask="0x3" edc:name="INT3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="INT3IP" edc:desc="" edc:mask="0x7" edc:name="INT3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="INT4IS" edc:desc="" edc:mask="0x3" edc:name="INT4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="INT4IP" edc:desc="" edc:mask="0x7" edc:name="INT4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F160" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC2" edc:desc="" edc:impl="0x1f1f1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC2" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNAIS" edc:desc="" edc:mask="0x3" edc:name="CNAIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CNAIP" edc:desc="" edc:mask="0x7" edc:name="CNAIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CNBIS" edc:desc="" edc:mask="0x3" edc:name="CNBIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CNBIP" edc:desc="" edc:mask="0x7" edc:name="CNBIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CNCIS" edc:desc="" edc:mask="0x3" edc:name="CNCIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CNCIP" edc:desc="" edc:mask="0x7" edc:name="CNCIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CNDIS" edc:desc="" edc:mask="0x3" edc:name="CNDIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CNDIP" edc:desc="" edc:mask="0x7" edc:name="CNDIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F170" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="--------------------------------" edc:cname="IPC3" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------------------" edc:name="IPC3" edc:nzwidth="32" edc:por="--------------------------------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="24"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F180" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="---nnnnn---nnnnn---nnnnn--------" edc:cname="IPC4" edc:desc="" edc:impl="0x001F1F1F" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000--------" edc:name="IPC4" edc:nzwidth="32" edc:por="---00000---00000---00000--------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="T1IS" edc:desc="" edc:mask="0x3" edc:name="T1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="T1IP" edc:desc="" edc:mask="0x7" edc:name="T1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="T2IS" edc:desc="" edc:mask="0x3" edc:name="T2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="T2IP" edc:desc="" edc:mask="0x7" edc:name="T2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="T3IS" edc:desc="" edc:mask="0x3" edc:name="T3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="T3IP" edc:desc="" edc:mask="0x7" edc:name="T3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F190" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="---nnnnn------------------------" edc:cname="IPC5" edc:desc="" edc:impl="0x1f000000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000------------------------" edc:name="IPC5" edc:nzwidth="32" edc:por="---00000------------------------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="24"/>
            <edc:SFRFieldDef edc:cname="CMP1IS" edc:desc="" edc:mask="0x3" edc:name="CMP1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CMP1IP" edc:desc="" edc:mask="0x7" edc:name="CMP1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F1A0" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="-------------------nnnnn---nnnnn" edc:cname="IPC6" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------00000---00000" edc:name="IPC6" edc:nzwidth="32" edc:por="-------------------00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMP2IS" edc:desc="" edc:mask="0x3" edc:name="CMP2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CMP2IP" edc:desc="" edc:mask="0x7" edc:name="CMP2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CMP3IS" edc:desc="" edc:mask="0x3" edc:name="CMP3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CMP3IP" edc:desc="" edc:mask="0x7" edc:name="CMP3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F1B0" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="-------------------nnnnn--------" edc:cname="IPC7" edc:desc="" edc:impl="0x1f00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------00000--------" edc:name="IPC7" edc:nzwidth="32" edc:por="-------------------00000--------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="USBIS" edc:desc="" edc:mask="0x3" edc:name="USBIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="USBIP" edc:desc="" edc:mask="0x7" edc:name="USBIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
